# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'

# CLI
brew 'android-sdk'
brew 'carthage'
brew 'composer'
brew 'ctags'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'ffmpeg'
brew 'gifsicle'
brew 'git-flow'
brew 'go'
brew 'heroku-toolbelt'
brew 'httpie'
brew 'libyaml'
brew 'mitmproxy'
brew 'ngrep'
brew 'node'
brew 'nmap'
brew 'openssl'
brew 'ssh-copy-id'
brew 'tree'
brew 'tmux'
brew 'watch'
brew 'wget'

# Apps
cask '1password'
cask 'alfred'
cask 'balsamiq-mockups'
cask 'bartender'
cask 'cocktail'
cask 'dropbox'
cask 'duet'
cask 'evernote'
cask 'firefox'
cask 'fluid'
cask 'flux'
cask 'geekbench'
cask 'google-chrome'
cask 'hazel'
cask 'istat-menus'
cask 'iterm2'
cask 'java'
cask 'kaleidoscope'
cask 'phpstorm'
cask 'screenflow'
cask 'sequel-pro'
cask 'skitch'
cask 'skype'
cask 'sonos'
cask 'steam'
cask 'sublime-text'
cask 'textexpander'
cask 'tower'
cask 'tunnelblick'
cask 'utorrent'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'

# Fonts
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-open-sans'
cask 'font-signika'
cask 'font-ubuntu'
cask 'font-ubuntu-mono-powerline'
cask 'font-yanone-kaffeesatz'

# Plugins
cask 'betterzipql'
cask 'colorpicker-skalacolor'
cask 'qlmarkdown'
cask 'quicklook-csv'
cask 'quicklook-json'
