# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'

# android-sdk formulae depends on it
cask 'java'

# CLI
brew 'android-sdk'
brew 'carthage'
brew 'ctags'
brew 'docker-compose'
brew 'docker-machine'
brew 'ffmpeg'
brew 'gifsicle'
brew 'git-flow'
brew 'glide'
brew 'go'
brew 'heroku-toolbelt'
brew 'httpie'
brew 'kubernetes-cli'
brew 'libyaml'
brew 'mas'
brew 'mitmproxy'
brew 'nmap'
brew 'ngrep'
brew 'node'
brew 'nmap'
brew 'openssl'
brew 'ssh-copy-id'
brew 'tree'
brew 'tmux'
brew 'watch'
brew 'wget'

# Apps
cask '1password'
cask 'appcleaner'
cask 'alfred'
cask 'balsamiq-mockups'
cask 'bartender'
cask 'cocktail'
cask 'docker'
cask 'dropbox'
cask 'duet'
cask 'evernote'
cask 'firefox'
cask 'fluid'
cask 'flux'
cask 'geekbench'
cask 'google-chrome'
cask 'hazel'
cask 'istat-menus'
cask 'iterm2'
cask 'kaleidoscope'
cask 'phpstorm'
cask 'screenflow'
cask 'sequel-pro'
cask 'sketch'
cask 'skitch'
cask 'sonos'
cask 'steam'
cask 'sublime-text3'
cask 'tower'
cask 'tunnelblick'
cask 'utorrent'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'

# Mac AppStore
mas 'Quiver (3.0.3)', id: 866773894
mas 'Monity (1.4.1)', id: 915542151
mas 'Keynote (7.0.5)', id: 409183694
mas 'Browser Fairy (1.7.5)', id: 483014855
mas 'Copied (1.1.9)', id: 1026349850
mas 'Skitch (2.7.8)', id: 425955336
mas 'The Unarchiver (3.11.1)', id: 425424353
mas 'Screens (3.8.4)', id: 446107677
mas 'Marked 2 (2.5.8)', id: 890031187
mas 'Pixelmator (3.6)', id: 407963104
mas 'DaisyDisk (4.3)', id: 411643860
mas 'Divvy (1.5)', id: 413857545
mas 'Tweetbot (2.4.4)', id: 557168941
mas 'Numbers (4.0.5)', id: 409203825
mas 'Xcode (8.1)', id: 497799835
mas 'Wunderlist (3.4.5)', id: 410628904
mas 'Pages (6.0.5)', id: 409201541
mas 'Fantastical (1.3.19)', id: 435003921
mas 'Trillian (3.4)', id: 412056820
mas 'Yoink (3.2.6)', id: 457622435
mas 'Deliveries (2.1.2)', id: 924726344
mas 'Dash (2.2.6)', id: 458034879

# Fonts
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-open-sans'
cask 'font-signika'
cask 'font-ubuntu'
cask 'font-ubuntu-mono-powerline'
cask 'font-yanone-kaffeesatz'

# Plugins
cask 'betterzipql'
cask 'colorpicker-skalacolor'
cask 'qlmarkdown'
cask 'quicklook-csv'
cask 'quicklook-json'
